  else
            Application->MessageBox(L"Слишком много точек регистрации для введённого диапазона. Повторите ввод.",L"Внимание",MB_OK);
          }
        else
          Application->MessageBox(L"Конечное положение должно быть больше начального. Повторите ввод.",L"Внимание",MB_OK);
        }
      else
        Application->MessageBox(L"Введённые углы выходят за максимальный рабочий диапазон. Повторите ввод.",L"Внимание",MB_OK);
      }
    else
      Application->MessageBox(L"Значение количества точек регистрации введено некорректно. Повторите ввод.",L"Внимание",MB_OK);
    else
            Application->MessageBox(L"Слишком много точек регистрации для введённого диапазона. Повторите ввод.",L"Внимание",MB_OK);
          }
        else
          Application->MessageBox(L"Конечное положение должно быть больше начального. Повторите ввод.",L"Внимание",MB_OK);
        }
      else
        Application->MessageBox(L"Введённые углы выходят за максимальный рабочий диапазон. Повторите ввод.",L"Внимание",MB_OK);
      }
    else
      Application->MessageBox(L"Значение количества точек регистрации введено некорректно. Повторите ввод.",L"Внимание",MB_OK);
  